# Исправьте программу и допишите необходимые команды для получения нужного результата.
# Будьте внимательны при исправлении и помните о правилах названия переменных.
#
# Программа:
# first name = input('Введите имя пользователя: ')
# grииting = 'Утро доброе'
# print(greeting, first name)
# intro = "К сожалению, у Вас нет доступа к системе."
# info == "Пожалуйста, обратитесь к системному администратору."
if __name__ == '__main__':
    firstname = input('Введите имя пользователя: ')
    greeting = 'Утро доброе,'
    print(greeting, firstname)
    intro = "К сожалению, у Вас нет доступа к системе."
    info = "Пожалуйста, обратитесь к системному администратору."
    print(intro)
    print(info)
