# Найдите в программе необъявленную переменную и объявите её, присвоив ей значение ‘Кот’.
#
# client = ‘Петя’
# print(client)
# print(‘ и ’)
# print(pet)

if __name__ == '__main__':
    client = 'Петя'
    pet = 'кот'
    print(client)

    print(' и ')

    print(pet)

