# Задача 3. Ошибки в коде
#
# Дана программа
# Скопируйте программу в редактор и исправьте ошибки в названиях и выводе переменных.
# При необходимости переставляйте строчки местами.
# Проверьте правильность работы программы.
if __name__ == '__main__':
    my_color = 'Зелёный'
    sport = 'Бег'
    name = 'Иван'
    print('Меня зовут:')
    print(name)
    print('Мой любимый цвет:')
    print(my_color)
    print('Мой любимый вид спорта:')
    print(sport)