# Задача 2. Тестируем приложение
#
# Напишите программу, которая имитирует работу с приложением: программа спрашивает
# у пользователя «Продолжаем работать? 1/0: » до тех пор, пока пользователь не введёт 0,
# — после этого выводится сообщение: «Приложение закрывается…».
# В конце программы также выводится сообщение: «Работа завершена».
# Для создания бесконечного цикла используйте while True.
#
if __name__ == '__main__':
    while True:
        work = int(input('Продолжаем работать? 1/0 '))
        if work == 0:
            print('Приложение закрывается…')
            break
    print('Работа завершена!')
